---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.CannotCreateCurtainPanelInOpeningCorruption
source: html/0601dffc-68ac-f94d-2536-0fdbe4891e08.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.CannotCreateCurtainPanelInOpeningCorruption Property

Can't create Curtain Panel in opening. The opening is probably too small.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateCurtainPanelInOpeningCorruption { get; }
```